import { Injectable } from '@angular/core';



const firstContent = '전자구매시스템의 협력업체 이용약관제 1 조(목적)본 약관은 남해화학(주)(이하 "제공자")에서 제공하는 남해화학 전자구매시스템의 이용에 관한 사항에 대해 규정하는 것을 목적으로 합니다. 제 2 조(정의)① "이용자”란 남해화학(주)의 전자구매시스템에 접속하여 이 약관에 따라 전자구매시스템을 이용하는 협력회사를 말합니다.② "협력회사"란 남해화학(주)에서 제공하는 전자구매 시스템에서 정한 절차에 따라 기업정보를 제공하여 회원등록을 한 개인 및 법인으로서, 전자구매시스템의 정보를 지속적으로 제공 받으며, 전자구매시스템에서 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.제 3 조(약관의 효력 및 변경)① 본 약관은 이용자가 동의함으로써 효력을 발생합니다.② 제공자는 운영 또는 영업상 중요 사유가 있을 경우 약관을 변경할 수 있으며, 게시판에 변경된 내용을 공시하는 방법으로 변경효력을 발생합니다.제 4 조(약관외 준칙)본 약관에 명시되지 않은 사항은 관계법령에 규정한 바에 따릅니다.제 5 조(서비스 내용)① 구매품목에 대한 현황 조회, 견적참여 및 정보교류 등의 구매정보 제공② 제공자는 필요한 경우 제공하는 서비스의 내용을 변경할 수 있으며 이 경우 게시판을 통하여 공지합니다.③ 시스템의 교체, 보수, 정기점검 및 기타 불가항력적인 사유가 발생할 경우에는 서비스가 일시 중지 될 수도 있으며 이로 인한 이용자의 손해에 대해서 제공자는 배상을 하지 않습니다.제 6 조(신규등록)① 이용자는 제공자가 요구하는 소정의 정보를 작성함으로써 신규등록을 신청합니다.② 제공자는 다음 각 호에 해당되지 않는 한 이용자에게 회원가입이 승인 되었음을 통보함으로써 신규등록이 이루어 집니다.1.이용신청서의 내용을 허위, 기재누락 또는 오기가 있는 경우2.타인의 명의로 신청한 경우3.이용신청서의 내용을 허위로 기재한 경우4.사회적 미풍약속 및 기타 사회질서를 저해하거나 범죄에 이용하고자 하는 경우제 7 조(서비스 이용제한)제공자는 서비스의 내용 및 이용자의 요청에 따라 서비스 이용을 제한 할 수 있습니다.제 8 조(정보관리)① 제공자는 이용자의 정보를 이용자의 승낙없이 타인에게 제공하거나 누설할 수 없습니다. 단, 전기통신관련법령 또는 관계법령에 의거하여 수사기관 및 해당 국가기관이 요청하여 정보를 제공해야 하는 경우는 제외② 본 약관 5조 2항에 의거 제공자가 이용자의 신청을 승낙하지 아니하는 경우 즉시 이용자의 정보는 제공자 서버에서 삭제됩니다.제 9 조(ID 및 비밀번호등 관리)① 이용자의 ID와 비밀번호에 관한 관리책임은 이용자에게 있습니다.② 이용자는 두 개의 ID를 가질수 없습니다.③ 이용자는 자신의 ID가 타인에 의해 무단 이용되는 경우, 즉시 이를 회사에 통보해야 합니다.④ 제공자는 위 8조 1항을 위반한 경우를 제외하고는 ID 및 비밀번호 노출에 대하여 일체의 책임을 지지 않습니다.제 10 조(게시물 삭제)제공자는 이용자가 게시하거나 등록하는 내용물이 다음 각 호에 해당하는 경우, 사전통지 없이 이를 삭제할 수 있습니다.1.타인의 명예를 훼손시키거나 모욕하는 경우2.타인의 저작권을 침해하여 그 타인으로부터 삭제요구가 있는 경우3.기타 관련 법령이 정하는 경우제 11 조(이용자 정보변경)이용자는 등록된 정보에 관하여 변동사항이 있을 경우 성실하게 수정하여야 합니다.제 12 조(이용해지)① 이용자는 언제든지 이용계약을 해지할 수 있습니다.② 제공자는 다음 각 호에 해당하는 경우 이용계약을 해지하거나 서비스 이용을 중지 시킬수 있습니다1.이용자가 사회적 미풍양속 및 기타 사회질서를 저해하며 서비스를 이용할 경우 2.서비스를 범죄행위에 사용하거나 사용하고자 하는 경우3.ID 및 비밀번호를 부정하게 사용하는 경우4.신규등록시에 기재한 내용이 허위임이 밝혀지는 경우 5.서비스 이용을 방해하거나 방해하고자 하는 경우6.기타 제공자가 정한 이용조건을 위배하는 경우③ 위 2항의 조치에 대하여 이용자는 이의 신청을 할 수 있고, 이용자는 이의 신청이 정당하다고 판단되는 경우 즉시 서비스 이용을 재개해야 합니다.제 13 조(관 할)① 서비스 이용과 관련하여 제공자와 이용자사이에 분쟁이 발생한 경우, 쌍방간에 분쟁의 해결을 위해 성실히 협의를 하도록 합니다.② 위 1항의 협의에서도 분쟁이 해결되지 않는 경우, 관할법원은 제공자의 본점 소재지를 관할하는 법원으로 합니다.제 14 조(개인정보보호 정책)① 회사는 관련법령이 정하는 바에 따라서 이용자 등록정보를 포함한 이용자의 개인정보를 보호하기 위하여 노력한다. 이용자의 개인정보보호에 관해서는 관련법령 및 회사가 정하는 "개인정보보호정책"에 정한 바에 의한다. (부칙) (시행일) 본 약관은 2010년 01월 01부터 시행합니다.';
const secondContent = '⊙ 수집항목 : 담당자 성명, 핸드폰, 이메일, 부정행위 방지용(사용PC IP 및 Mac주소 ) 등\n         - 이용목적 : 회사는 회원가입, 상담, 구매서비스 등을 위해 상기 개인정보를 수집하고 있습니다. \n         - 보유·이용기간 : 수집한 개인정보는 수집·이용에 관한 동의일로부터 별도의 파기요청이 있을 때 까지 위 이용 목적을 위하여 보유·이용됩니다.';



@Injectable()
export class Service {

  getContent(flag: string) {
    if(flag == "first")
      return firstContent;
    else if (flag == "second")
      return secondContent;
    else
      return null;
  }

}
